; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-5-9)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	city0 - city
	city1 - city
	city2 - city
	)
(:init
	(at plane1 city1)
	(= (capacity plane1) 2142)
	(= (fuel plane1) 68)
	(= (slow-burn plane1) 1)
	(= (fast-burn plane1) 3)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 6)
	(at plane2 city2)
	(= (capacity plane2) 7093)
	(= (fuel plane2) 582)
	(= (slow-burn plane2) 3)
	(= (fast-burn plane2) 8)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 3)
	(at plane3 city1)
	(= (capacity plane3) 7114)
	(= (fuel plane3) 447)
	(= (slow-burn plane3) 3)
	(= (fast-burn plane3) 11)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 6)
	(at plane4 city1)
	(= (capacity plane4) 3013)
	(= (fuel plane4) 361)
	(= (slow-burn plane4) 1)
	(= (fast-burn plane4) 3)
	(= (onboard plane4) 0)
	(= (zoom-limit plane4) 7)
	(at plane5 city0)
	(= (capacity plane5) 11517)
	(= (fuel plane5) 2458)
	(= (slow-burn plane5) 5)
	(= (fast-burn plane5) 17)
	(= (onboard plane5) 0)
	(= (zoom-limit plane5) 1)
	(at person1 city0)
	(at person2 city0)
	(at person3 city2)
	(at person4 city0)
	(at person5 city2)
	(at person6 city2)
	(at person7 city0)
	(at person8 city0)
	(at person9 city1)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 505)
	(= (distance city0 city2) 861)
	(= (distance city1 city0) 505)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 575)
	(= (distance city2 city0) 861)
	(= (distance city2 city1) 575)
	(= (distance city2 city2) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane1 city0)
	(at plane5 city2)
	(at person1 city2)
	(at person2 city2)
	(at person3 city1)
	(at person4 city0)
	(at person5 city1)
	(at person6 city0)
	(at person7 city2)
	(at person8 city2)
	(at person9 city0)
	))

(:metric minimize (+ (* 3 (total-time))  (* 2 (total-fuel-used))))
)

; plan
1. (refuel plane5 city0)
   changed: (fuel plane5) from 2458 to 11517
   goals met: 1 of 11
2. (refuel plane1 city1)
   changed: (fuel plane1) from 68 to 2142
   goals met: 1 of 11
3. (board person1 plane5 city0)
   deleted: (at person1 city0)
   added: (in person1 plane5)
   changed: (onboard plane5) from 0 to 1
   goals met: 1 of 11
4. (board person2 plane5 city0)
   deleted: (at person2 city0)
   added: (in person2 plane5)
   changed: (onboard plane5) from 1 to 2
   goals met: 1 of 11
5. (board person7 plane5 city0)
   deleted: (at person7 city0)
   added: (in person7 plane5)
   changed: (onboard plane5) from 2 to 3
   goals met: 1 of 11
6. (board person8 plane5 city0)
   deleted: (at person8 city0)
   added: (in person8 plane5)
   changed: (onboard plane5) from 3 to 4
   goals met: 1 of 11
7. (board person9 plane1 city1)
   deleted: (at person9 city1)
   added: (in person9 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 1 of 11
8. (fly plane1 city1 city0)
   deleted: (at plane1 city1)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 0 to 505, (fuel plane1) from 2142 to 1637
   goals met: 2 of 11
9. (debark person9 plane1 city0)
   deleted: (in person9 plane1)
   added: (at person9 city0)
   changed: (onboard plane1) from 1 to 0
   goals met: 3 of 11
10. (fly plane5 city0 city2)
   deleted: (at plane5 city0)
   added: (at plane5 city2)
   changed: (total-fuel-used) from 505 to 4810, (fuel plane5) from 11517 to 7212
   goals met: 4 of 11
11. (debark person1 plane5 city2)
   deleted: (in person1 plane5)
   added: (at person1 city2)
   changed: (onboard plane5) from 4 to 3
   goals met: 5 of 11
12. (debark person2 plane5 city2)
   deleted: (in person2 plane5)
   added: (at person2 city2)
   changed: (onboard plane5) from 3 to 2
   goals met: 6 of 11
13. (debark person7 plane5 city2)
   deleted: (in person7 plane5)
   added: (at person7 city2)
   changed: (onboard plane5) from 2 to 1
   goals met: 7 of 11
14. (debark person8 plane5 city2)
   deleted: (in person8 plane5)
   added: (at person8 city2)
   changed: (onboard plane5) from 1 to 0
   goals met: 8 of 11
15. (board person3 plane5 city2)
   deleted: (at person3 city2)
   added: (in person3 plane5)
   changed: (onboard plane5) from 0 to 1
   goals met: 8 of 11
16. (board person5 plane5 city2)
   deleted: (at person5 city2)
   added: (in person5 plane5)
   changed: (onboard plane5) from 1 to 2
   goals met: 8 of 11
17. (board person6 plane5 city2)
   deleted: (at person6 city2)
   added: (in person6 plane5)
   changed: (onboard plane5) from 2 to 3
   goals met: 8 of 11
18. (fly plane5 city2 city1)
   deleted: (at plane5 city2)
   added: (at plane5 city1)
   changed: (total-fuel-used) from 4810 to 7685, (fuel plane5) from 7212 to 4337
   goals met: 7 of 11
19. (debark person3 plane5 city1)
   deleted: (in person3 plane5)
   added: (at person3 city1)
   changed: (onboard plane5) from 3 to 2
   goals met: 8 of 11
20. (debark person5 plane5 city1)
   deleted: (in person5 plane5)
   added: (at person5 city1)
   changed: (onboard plane5) from 2 to 1
   goals met: 9 of 11
21. (fly plane5 city1 city0)
   deleted: (at plane5 city1)
   added: (at plane5 city0)
   changed: (total-fuel-used) from 7685 to 10210, (fuel plane5) from 4337 to 1812
   goals met: 9 of 11
22. (debark person6 plane5 city0)
   deleted: (in person6 plane5)
   added: (at person6 city0)
   changed: (onboard plane5) from 1 to 0
   goals met: 10 of 11
23. (refuel plane5 city0)
   changed: (fuel plane5) from 1812 to 11517
   goals met: 10 of 11
24. (fly plane5 city0 city2)
   deleted: (at plane5 city0)
   added: (at plane5 city2)
   changed: (total-fuel-used) from 10210 to 14515, (fuel plane5) from 11517 to 7212
   goals met: 11 of 11
